app/Http/Controllers/FormsController.php

insert into `feedback` (`fio`, `email`, `phone`, `address`, `message`, `updated_at`, `created_at`) values ('Kamron Rustambekov', 'kamronrustambekov22@gmail.com', '900962646', 'Самарканд', 'asasfasfas', '2026-03-30 17:40:34', '2026-03-30 17:40:34')
---
    public function contact(Request $request)
    {
        // Captcha check
        $captchaInput = strtolower(trim($request->input('captcha_code', '')));
        $captchaSession = strtolower(trim(session('captcha_code', '')));
        if (empty($captchaInput) || $captchaInput !== $captchaSession) {
            return redirect()->back()
                ->withInput()
                ->withErrors(['captcha_code' => 'Invalid captcha. Please try again.']);
        }
        session()->forget('captcha_code');

        $validated = $request->validate([
            'fio'     => 'required|string|max:255',
            'email'   => 'required|email|max:255',
            'phone'   => 'nullable|string|max:50',
            'address' => 'nullable|string|max:255',
            'subject' => 'nullable|string|max:255',
            'message' => 'required|string|max:5000',
        ]);

        $ip = $request->header('X-Forwarded-For') ?? $request->ip();

        $fullMessage = $validated['message'];
        if (!empty($validated['subject'])) {
            $fullMessage = '[' . $validated['subject'] . '] ' . $fullMessage;
        }

        Feedback::create([
            'fio'     => $validated['fio'],
            'email'   => $validated['email'],
            'phone'   => $validated['phone'] ?? null,
            'address' => $validated['address'] ?? null,
            'message' => $fullMessage,
        ]);